Repository: ferseiti/installation-guide
Catalog: po/*/hardware.po
Languages: fr

source: On many older devices which require firmware to work, the firmware file was permanently placed in an EEPROM/Flash chip on the device itself by the manufacturer. Nowadays most new devices do not have the firmware embedded this way anymore, so the firmware file must be uploaded into the device by the host operating system every time the system boots.
fr: Pour beaucoup de périphériques anciens, le microprogramme était placé par le fabricant sur le périphérique lui-même, sur une puce EEPROM/Flash. Aujourd'hui, les périphériques n'embarquent plus de microprogramme de cette façon. Le microprogramme doit être chargé sur le périphérique par le système d'exploitation à chaque démarrage.

source: In most cases firmware is non-free according to the criteria used by the &debian-gnu; project and thus cannot be included in the main distribution or in the installation system. If the device driver itself is included in the distribution and if &debian-gnu; legally can distribute the firmware, it will often be available as a separate package from the non-free section of the archive.
fr: Dans la plupart des cas, le microprogramme n'est pas libre selon les critères du projet &debian; et ne peut donc être inclus dans la section <emphasis>main</emphasis> de l'archive ou dans le système d'installation. Si le pilote lui-même est inclus dans la distribution et si le projet &debian; peut distribuer légalement le microprogramme, il sera disponible sous forme de paquet dans la section <emphasis>non-free</emphasis> de l'archive.

source: However, this does not mean that such hardware cannot be used during an installation. Starting with &debian-gnu; 5.0, &d-i; supports loading firmware files or packages containing firmware from a removable medium, such as a USB stick. See <xref linkend="loading-firmware"/> for detailed information on how to load firmware files or packages during the installation.
fr: Cependant, cela ne signifie pas que ce type de matériel ne puisse pas être utilisé pendant l'installation. À partir de &debian-gnu; 5.0, l'installateur sait charger des microprogrammes sous forme de simple fichier ou sous forme de paquet sur des supports amovibles comme une clé USB. Consultez la <xref linkend="loading-firmware"/> pour des précisions sur la manière de télécharger des microprogrammes pendant l'installation.

source: If the &d-i; prompts for a firmware file and you do not have this firmware file available or do not want to install a non-free firmware file on your system, you can try to proceed without loading the firmware. There are several cases where a driver prompts for additional firmware because it may be needed under certain circumstances, but the device does work without it on most systems (this e.g. happens with certain network cards using the tg3 driver).
fr: Si l'&d-i; demande un microprogramme qui n'est pas disponible ou que vous ne voulez pas installer un microprogramme non libre, vous pouvez continuer l'installation sans télécharger le microprogramme. Certains pilotes demandent des microprogrammes supplémentaires parce qu'ils sont nécessaires dans certaines circonstances, mais le périphérique fonctionnera sans sur la plupart des systèmes. Ainsi, cela arrive avec des cartes réseau utilisant le pilote tg3.

source: Purchasing Hardware Specifically for GNU/&arch-kernel;
fr: Acheter du matériel spécialement pour GNU/&arch-kernel;

source: There are several vendors, who ship systems with &debian; or other distributions of GNU/Linux <ulink url="&url-pre-installed;">pre-installed</ulink>. You might pay more for the privilege, but it does buy a level of peace of mind, since you can be sure that the hardware is well-supported by GNU/Linux.
fr: Il existe des vendeurs qui livrent des systèmes en <ulink url="&url-pre-installed;">pré-installant</ulink> &debian; ou d'autres distributions de GNU/Linux. Vous paierez peut-être plus cher pour avoir ce privilège, mais vous achetez ainsi un peu de tranquillité d'esprit, puisque vous serez certain que le matériel est bien reconnu par GNU/Linux.

source: If you do have to buy a machine with Windows bundled, carefully read the software license that comes with Windows; you may be able to reject the license and obtain a rebate from your vendor. Searching the Internet for <quote>windows refund</quote> may get you some useful information to help with that.
fr: Si vous devez acheter un ordinateur fourni avec Windows, lisez attentivement la licence logicielle accompagnant Windows&nbsp;; vous pourrez peut-être rejeter la licence et obtenir un rabais de votre vendeur. Une recherche sur internet avec la chaîne <quote>remboursement Windows</quote> peut vous donner des pistes.

source: Whether or not you are purchasing a system with &arch-kernel; bundled, or even a used system, it is still important to check that your hardware is supported by the &arch-kernel; kernel. Check if your hardware is listed in the references found above. Let your salesperson (if any) know that you're shopping for a &arch-kernel; system. Support &arch-kernel;-friendly hardware vendors.
fr: Que vous achetiez ou non un système livré avec &arch-kernel;, ou même un système d'occasion, il est important de vérifier que votre matériel est reconnu par le noyau &arch-kernel;. Vérifiez si votre matériel est listé dans les références ci-dessus. Indiquez à votre revendeur que vous recherchez un système &arch-kernel;. Soutenez les revendeurs de matériel amis de &arch-kernel;.

source: Avoid Proprietary or Closed Hardware
fr: Éviter le matériel propriétaire ou fermé

source: Some hardware manufacturers simply won't tell us how to write drivers for their hardware. Others won't allow us access to the documentation without a non-disclosure agreement that would prevent us from releasing the driver's source code, which is one of the central elements of free software. Since we haven't been granted access to usable documentation on these devices, they simply won't work under &arch-kernel;.
fr: Certains constructeurs refusent simplement de fournir les informations qui permettraient d'écrire des pilotes pour leur matériel. D'autres n'autorisent pas l'accès à la documentation sans accord de confidentialité, ce qui nous empêche de distribuer le code source qui est l'élément essentiel du logiciel libre. Sans accès à une documentation utilisable, ces pilotes ne peuvent pas fonctionner sous &arch-kernel;.

source: In many cases there are standards (or at least some de-facto standards) describing how an operating system and its device drivers communicate with a certain class of devices. All devices which comply to such a (de-facto-)standard can be used with a single generic device driver and no device-specific drivers are required. With some kinds of hardware (e.g. USB <quote>Human Interface Devices</quote>, i.e. keyboards, mice, etc., and USB mass storage devices like USB flash disks and memory card readers) this works very well and practically every device sold in the market is standards-compliant.
fr: Le plus souvent il existe des normes (au moins, <emphasis>de facto</emphasis>) qui décrivent comment communiquent un système d'exploitation et ses pilotes de périphériques avec les différentes classes de périphériques. Tous les périphériques qui satisfont cette norme <emphasis>de facto</emphasis> peuvent fonctionner avec un pilote générique. Certains périphériques USB, clavier, souris, disque flash, lecteur de carte mémoire, fonctionnent ainsi très bien et pratiquement tous les modèles sur le marché se conforment à la norme.

source: In other fields, among them e.g. printers, this is unfortunately not the case. While there are many printers which can be addressed via a small set of (de-facto-)standard control languages and therefore can be made to work without problems in any operating system, there are quite a few models which only understand proprietary control commands for which no usable documentation is available and therefore either cannot be used at all on free operating systems or can only be used with a vendor-supplied closed-source driver.
fr: Mais dans certains domaines, par exemple celui des imprimantes, ce n'est pas le cas. Beaucoup d'imprimantes peuvent certes être contrôlées par des langages standardisés et peuvent donc fonctionner sans problème sur tout système d'exploitation. Cependant, quelques imprimantes ne comprennent que des commandes spéciales pour lesquelles aucune documentation n'est disponible. Elles ne peuvent donc pas fonctionner sur un système d'exploitation libre sans un pilote propriétaire fourni par le constructeur.

source: Even if there is a vendor-provided closed-source driver for such hardware when purchasing the device, the practical lifespan of the device is limited by driver availability. Nowadays product cycles have become short and it is not uncommon that a short time after a consumer device has ceased production, no driver updates get made available any more by the manufacturer. If the old closed-source driver does not work anymore after a system update, an otherwise perfectly working device becomes unusable due to lacking driver support and there is nothing that can be done in this case. You should therefore avoid buying closed hardware in the first place, regardless of the operating system you want to use it with.
fr: Même s'il existe un tel pilote propriétaire, sa disponibilité limite la durée de vie du périphérique. De nos jours, les cycles de vie des produits se raccourcissent et il n'est pas inhabituel de constater l'absence de mise à jour du pilote quand la production du périphérique a cessé. Si l'ancien pilote ne fonctionne plus après une mise à jour du système, un périphérique en parfait état devient inutilisable. On ne peut rien faire ! Vous devriez donc éviter d'acheter du matériel propriétaire, quelque soit le système d'exploitation que vous utilisez.

source: You can help improve this situation by encouraging manufacturers of closed hardware to release the documentation and other resources necessary for us to provide free drivers for their hardware.
fr: Vous pouvez changer cette situation en encourageant les constructeurs de matériel propriétaire à publier les documentations et tout autre moyen nécessaire à la programmation de pilotes libres pour leur matériel.

source: Installation Media
fr: Les supports d'installation

source: This section will help you determine which different media types you can use to install &debian;. There is a whole chapter devoted to media, <xref linkend="install-methods"/>, which lists the advantages and disadvantages of each media type. You may want to refer back to this page once you reach that section.
fr: Cette section précise les différents supports utilisables pour installer &debian;. Un chapitre entier est consacré aux supports, le <xref linkend="install-methods"/>&nbsp;; il indique les avantages et les désavantages de chaque support. Quand vous aurez atteint ce chapitre, vous pourrez vous reporter à cette page.

source: Floppies
fr: Les disquettes

source: In some cases, you'll have to do your first boot from floppy disks. Generally, all you will need is a high-density (1440 kilobytes) 3.5 inch floppy drive.
fr: Dans certains cas, vous devrez effectuer votre premier amorçage depuis un lecteur de disquettes. En général vous avez besoin d'une disquette haute densité (1440 kilo-octets) de 3,5 pouces.

source: For CHRP, floppy support is currently broken.
fr: Pour CHRP, l'utilisation de disquette est actuellement impossible.

source: Whenever you see <quote>CD-ROM</quote> in this manual, it applies to both CD-ROMs and DVD-ROMs, because both technologies are really the same from the operating system's point of view.
fr: Chaque fois que vous lirez <quote>CD</quote> dans ce manuel, cela voudra dire aussi bien CD-ROM que DVD-ROM, car, du point de vue du système d'exploitation, les deux techniques sont les mêmes.

source: CD-ROM based installation is supported for most architectures.
fr: L'installation à partir d'un CD est aussi possible avec la plupart des architectures.

source: On PCs SATA, IDE/ATAPI and SCSI CD-ROMs are supported.
fr: Les CD de type SCSI, SATA et IDE/ATAPI sont reconnus.

source: USB CD-ROM drives are also supported, as are FireWire devices that are supported by the ohci1394 and sbp2 drivers.
fr: Les lecteurs USB sont reconnus, comme le sont les périphériques FireWire reconnus par les pilotes ohci1394 et sbp2.

source: IDE/ATAPI CD-ROMs are supported on all ARM machines.
fr: Les CD IDE/ATAPI sont reconnus par toutes les architectures ARM.

source: On SGI machines, booting from CD-ROM requires a SCSI CD-ROM drive capable of working with a logical blocksize of 512 bytes. Many of the SCSI CD-ROM drives sold on the PC market do not have this capability. If your CD-ROM drive has a jumper labeled <quote>Unix/PC</quote> or <quote>512/2048</quote>, place it in the <quote>Unix</quote> or <quote>512</quote> position. To start the install, simply choose the <quote>System installation</quote> entry in the firmware.
fr: Sur les machines SGI, amorcer depuis un CD demande un lecteur SCSI qui puisse fonctionner avec un bloc logique de 512 octets. La plupart des lecteurs SCSI vendus sur le marché ne le peuvent pas. Si votre lecteur possède un cavalier <quote>Unix/PC ou 512/2048</quote>, mettez-le en position <quote>Unix</quote> ou <quote>512</quote>. Pour commencer l'installation, choisissez l'entrée <quote>System installation</quote> dans le microprogramme.

source: USB Memory Stick
fr: Les clés USB

source: USB flash disks a.k.a. USB memory sticks have become a commonly used and cheap storage device. Most modern computer systems also allow booting the &d-i; from such a stick. Many modern computer systems, in particular netbooks and thin laptops, do not have a CD/DVD-ROM drive anymore at all and booting from USB media ist the standard way of installing a new operating system on them.
fr: Les disques flash USB, (clés USB), sont des périphériques de stockage bon marché et très utilisés. La plupart des systèmes modernes permettent d'amorcer l'&d-i; à partir d'une clé USB. Ainsi, pour ceux qui ne possèdent pas de lecteur de CD, comme les netbooks ou les ultraportables, l'installation d'un nouveau système peut se faire par une clé USB.

source: Network
fr: Le réseau

source: The network can be used during the installation to retrieve files needed for the installation. Whether the network is used or not depends on the installation method you choose and your answers to certain questions that will be asked during the installation. The installation system supports most types of network connections (including PPPoE, but not ISDN or PPP), via either HTTP or FTP. After the installation is completed, you can also configure your system to use ISDN and PPP.
fr: Pendant l'installation, le téléchargement des fichiers nécessaires peut se faire par le réseau. Selon le type d'installation que vous avez choisi et les réponses que vous donnez à certaines questions, le réseau est utilisé ou non. Le système d'installation accepte la plupart des modes de connexion (PPPoE, par exemple, mais pas ISDN ou PPP), par HTTP ou FTP. Une fois l'installation terminée, vous pouvez configurer les modes ISDN ou PPP.

source: You can also <emphasis>boot</emphasis> the installation system over the network without needing any local media like CDs/DVDs or USB sticks. If you already have a netboot-infrastructure available (i.e. you are already running DHCP and TFTP services in your network), this allows an easy and fast deployment of a large number of machines. Setting up the necessary infrastructure requires a certain level of technical experience, so this is not recommended for novice users. <phrase arch="mips;mipsel">This is the preferred installation technique for &arch-title;.</phrase>
fr: Vous pouvez aussi <emphasis>amorcer</emphasis> le système d'installation sur le réseau, sans CD ni clé USB. Si vous avez l'infrastructure nécessaire — votre réseau fait fonctionner des services DHCP et TFTP —, il est très facile et rapide de déployer un grand nombre de machines. Mettre en œuvre une telle infrastructure exige cependant une certaine expérience technique qui n'est pas à la portée des débutants. <phrase arch="mips;mipsel">C'est la méthode d'installation préférée pour &arch-title;.</phrase>

source: Diskless installation, using network booting from a local area network and NFS-mounting of all local filesystems, is another option.
fr: L'installation sans disque, en utilisant le démarrage par réseau et le montage par NFS de tous les systèmes de fichiers locaux, est une autre possibilité.

source: Hard Disk
fr: Les disques durs

source: Booting the installation system directly from a hard disk is another option for many architectures. This will require some other operating system to load the installer onto the hard disk. This method is only recommended for special cases when no other installation method is available.
fr: L'installation à partir d'un disque local est aussi possible sur beaucoup d'architectures. Cela demande qu'un autre système d'exploitation charge l'installateur sur le disque dur. Cette méthode n'est recommandée que pour des cas spéciaux, quand aucune autre méthode n'est disponible.

source: Although the &arch-title; does not allow booting from SunOS (Solaris), you can install from a SunOS partition (UFS slices).
fr: Bien que &arch-title; ne permette pas de démarrer à partir de SunOS (Solaris), l'installation à partir d'une partition SunOS (tranches UFS) est tout à fait possible.

source: Un*x or GNU system
fr: Un*x ou système GNU

source: If you are running another Unix-like system, you could use it to install &debian-gnu; without using the &d-i; described in the rest of this manual. This kind of install may be useful for users with otherwise unsupported hardware or on hosts which can't afford downtime. If you are interested in this technique, skip to the <xref linkend="linux-upgrade"/>. This installation method is only recommended for advanced users when no other installation method is available.
fr: Si vous utilisez un système de type Unix, vous pouvez installer &debian-gnu; sans utiliser l'installateur qui est décrit dans la suite de ce manuel. Cette manière de faire peut servir à des utilisateurs qui possèdent un matériel non reconnu ou qui sont sur des machines qui ne peuvent se permettre un temps d'arrêt. Si cette technique vous intéresse, reportez-vous à la <xref linkend="linux-upgrade"/>. Cette méthode n'est recommandée que pour les experts, quand aucune autre méthode n'est disponible.

source: Supported Storage Systems
fr: Systèmes de stockage reconnus

source: The &debian; installer contains a kernel which is built to maximize the number of systems it runs on.
fr: L'installateur &debian; contient un noyau construit pour permettre de faire tourner un maximum de systèmes.

source: Generally, the &debian; installation system includes support for IDE (also known as PATA) drives, SATA and SCSI controllers and drives, USB, and FireWire. The supported file systems include FAT, Win-32 FAT extensions (VFAT) and NTFS.
fr: Le système d'installation &debian; reconnaît les disques IDE (PATA), les contrôleurs et disques SATA et SCSI, les périphériques USB et FireWire. Les systèmes de fichiers reconnus comprennent FAT, les extensions FAT Win-32 (VFAT) et NTFS.

source: Any storage system supported by the Linux kernel is also supported by the boot system. The following SCSI drivers are supported in the default kernel: <itemizedlist> <listitem><para> Sparc ESP </para></listitem> <listitem><para> PTI Qlogic,ISP </para></listitem> <listitem><para> Adaptec AIC7xxx </para></listitem> <listitem><para> NCR and Symbios 53C8XX </para></listitem> </itemizedlist> IDE systems (such as the UltraSPARC 5) are also supported. See <ulink url="&url-sparc-linux-faq;">Linux for SPARC Processors FAQ</ulink> for more information on SPARC hardware supported by the Linux kernel.
fr: Tout système de stockage reconnu par le noyau Linux est aussi reconnu par le système de démarrage. Les pilotes SCSI suivants sont reconnus dans le noyau par défaut&nbsp;: <itemizedlist> <listitem><para>Sparc ESP</para></listitem> <listitem><para>PTI Qlogic,ISP</para></listitem> <listitem><para>Adaptec AIC7xxx</para></listitem> <listitem><para>NCR et Symbios 53C8XX</para></listitem> </itemizedlist> Les systèmes IDE (tels que UltraSPARC 5) sont aussi reconnus. Voyez la <ulink url="&url-sparc-linux-faq;">FAQ Linux pour les processeurs SPARC</ulink> pour plus d'informations sur le matériel SPARC reconnu par le noyau Linux.

source: Any storage system supported by the Linux kernel is also supported by the boot system. Note that the current Linux kernel does not support floppies on CHRP systems at all.
fr: Tout système de stockage reconnu par le noyau Linux est aussi reconnu par le système de démarrage. Il faut remarquer que le noyau Linux actuel n'accepte pas du tout les disquettes sur les systèmes CHRP.

source: Any storage system supported by the Linux kernel is also supported by the boot system. Note that the current Linux kernel does not support the floppy drive.
fr: Tout système de stockage reconnu par le noyau Linux est aussi reconnu par le système de démarrage. Il faut remarquer que le noyau Linux actuel n'accepte pas les disquettes.

source: Any storage system supported by the Linux kernel is also supported by the boot system.
fr: Tout système de stockage reconnu par le noyau Linux est aussi reconnu par le système de démarrage.

source: Any storage system supported by the Linux kernel is also supported by the boot system. This means that FBA and ECKD DASDs are supported with the old Linux disk layout (ldl) and the new common S/390 disk layout (cdl).
fr: Tout système de stockage reconnu par le noyau Linux est aussi supporté par le système de démarrage. Cela signifie que les DASD FBA et ECKD sont reconnus pour les vieux formats de disque Linux (ldl) et le nouveau format de disque S/390 plus courant (cdl).

source: Memory and Disk Space Requirements
fr: Mémoire et espace disque nécessaires

source: You must have at least &minimum-memory; of memory and &minimum-fs-size; of hard disk space to perform a normal installation. Note that these are fairly minimal numbers. For more realistic figures, see <xref linkend="minimum-hardware-reqts"/>.
fr: Vous devez posséder au moins &minimum-memory; de mémoire vive et &minimum-fs-size; d'espace disque. Ce sont vraiment des valeurs minimales. Pour une estimation plus réaliste, voyez la <xref linkend="minimum-hardware-reqts"/>.

source: Installation on systems with less memory<footnote condition="gtk"> <para> Installation images that support the graphical installer require more memory than images that support only the textual installer and should not be used on systems with less than &minimum-memory; of memory. If there is a choice between booting the text-based and the graphical installer, the former should be selected. </para> </footnote> or disk space available may be possible but is only advised for experienced users.
fr: L'installation sur des systèmes avec moins de mémoire <footnote condition="gtk"> <para> L'installateur graphique demande plus de mémoire que l'installateur texte. Il ne doit pas être utilisé sur des systèmes avec une quantité de mémoire inférieure à &minimum-memory;. Si un choix est proposé, il vaut mieux sélectionner l'installateur texte. </para> </footnote> ou avec moins d'espace disque disponible est encore possible mais ce n'est recommandé qu'aux utilisateurs expérimentés.
