Repository: ferseiti/installation-guide
Catalog: po/*/hardware.po
Languages: fr

source: <title>CPU</title>
fr: <title>Microprocesseurs</title>

source: Nearly all x86-based (IA-32) processors still in use in personal computers are supported, including all varieties of Intel's "Pentium" series. This also includes 32-bit AMD and VIA (former Cyrix) processors, and processors like the Athlon XP and Intel P4 Xeon.
fr: Quasiment tous les processeurs de la famille x86 (IA-32), toute la série Pentium d'Intel encore en usage sur les PC sont reconnus&nbsp;; cela veut dire également les processeurs 32 bits AMD et VIA (anciennement Cyrix) et les processeurs tels que Athlon XP et Intel P4 Xeon.

source: However, &debian; GNU/Linux &releasename; will <emphasis>not</emphasis> run on 386 or earlier processors. Despite the architecture name "i386", support for actual 80386 processors (and their clones) was dropped with the Sarge (r3.1) release of &debian;<footnote> <para> We have long tried to avoid this, but in the end it was necessary due a unfortunate series of issues with the compiler and the kernel, starting with an bug in the C++ ABI provided by GCC. You should still be able to run &debian; GNU/Linux on actual 80386 processors if you compile your own kernel and compile all packages from source, but that is beyond the scope of this manual. </para> </footnote>. (No version of Linux has ever supported the 286 or earlier chips in the series.) All i486 and later processors are still supported<footnote> <para> Many &debian; packages will actually run slightly faster on modern computers as a positive side effect of dropping support for these old chips. The i486, introduced in 1989, has three opcodes (bswap, cmpxchg, and xadd) which the i386, introduced in 1986, did not have. Previously, these could not be easily used by most &debian; packages; now they can. </para> </footnote>.
fr: Cependant, &debian; GNU/Linux &releasename; <emphasis>ne fonctionnera pas</emphasis> sur les processeurs 386 ou antérieurs. Malgré le nom de l'architecture, <quote>i386</quote>, la gestion des processeurs 80386 (et de leurs clones) a été abandonnée depuis la version r3.1 de Sarge <footnote> <para> Nous avons longtemps essayé d'éviter cet abandon mais il est devenu nécessaire à cause de problèmes malheureux avec le compilateur et le noyau, en commençant par un bogue dans l'ABI C++ fournie par GCC. Il est toujours possible d'installer &debian; GNU/Linux sur des processeurs 80386 mais il faut compiler le noyau et tous les paquets à partir des sources. </para> </footnote>. (Aucune version de Linux n'a jamais fonctionné avec les processeurs 286 ou antérieurs.) Tous les processeurs 586 sont gérés <footnote> <para> Beaucoup de paquets &debian; fonctionneront légèrement plus vite sur des ordinateurs modernes, c'est un effet positif de l'abandon de la gestion des anciens processeurs. Le processeur i486, lancé en 1989, possède trois <quote>opcodes</quote>, bswap, cmpxchg et xadd que ne possède pas l'i386, lancé en 1986. Les paquets &debian; ne pouvaient pas les utiliser facilement. </para> </footnote>.

source: If your system has a 64-bit processor from the AMD64 or Intel 64 families, you will probably want to use the installer for the amd64 architecture instead of the installer for the (32-bit) i386 architecture.
fr: Si votre système possède un processeur 64 bits des familles AMD64 ou Intel 64, vous devriez utiliser l'installateur pour l'architecture amd64 au lieu de l'installateur pour l'architecture i386 (32 bits).

source: I/O Bus
fr: Bus d'entrée sortie

source: The system bus is the part of the motherboard which allows the CPU to communicate with peripherals such as storage devices. Your computer must use the ISA, EISA, PCI, PCIe, PCI-X, or VESA Local Bus (VLB, sometimes called the VL bus). Essentially all personal computers sold in recent years use one of these.
fr: Le bus système est la partie de la carte mère permettant au processeur de communiquer avec les périphériques tels que les périphériques de stockage. Votre ordinateur doit utiliser l'un des bus ISA, EISA, PCI, PCIe, PCI-X ou VESA Local Bus (VLB, parfois appelé bus VL). Tous les PC vendus ces dernières années utilisent l'un d'entre eux.

source: &debian; on &arch-title; supports the following platforms: <itemizedlist> <listitem><para> SGI IP22: this platform includes the SGI machines Indy, Indigo 2 and Challenge S. Since these machines are very similar, whenever this document refers to the SGI Indy, the Indigo 2 and Challenge S are meant as well. </para></listitem> <listitem><para> SGI IP32: this platform is generally known as SGI O2. </para></listitem> <listitem><para> MIPS Malta: this platform is emulated by QEMU and is therefore a nice way to test and run &debian; on MIPS if you don't have the hardware. </para></listitem> </itemizedlist> Complete information regarding supported mips/mipsel machines can be found at the <ulink url="&url-linux-mips;">Linux-MIPS homepage</ulink>. In the following, only the systems supported by the &debian; installer will be covered. If you are looking for support for other subarchitectures, please contact the <ulink url="&url-list-subscribe;"> debian-&arch-listname; mailing list</ulink>.
fr: &debian; sur &arch-title; gère les plates-formes suivantes&nbsp;: <itemizedlist> <listitem><para> SGI IP22&nbsp;: Cette plate-forme englobe les machines SGI Indy, Indigo 2 et Challenge S. Puisque ces machines sont très semblables, chaque fois que ce document se rapporte aux machines SGI Indy, cela concerne aussi les machines Indigo 2 et Challenge S. </para></listitem> <listitem><para> SGI IP32&nbsp;: cette plate-forme est connue comme SGI O2. </para></listitem> <listitem><para> MIPS Malta&nbsp;: cette plate-forme est simulée par QEMU. C'est un bon moyen de tester &debian; sur ARM quand on ne possède pas le matériel. </para></listitem> </itemizedlist> Une information complète à propos des machines mips/mipsel se trouve dans la <ulink url="&url-linux-mips;">page Linux-MIPS</ulink>. Dans la suite, seuls les systèmes gérés par l'installateur &debian; seront traités. Si vous recherchez de l'aide pour d'autres sous-architectures, vous pouvez contacter la <ulink url="&url-list-subscribe;">liste de diffusion debian-&arch-listname;</ulink>.

source: On SGI IP22, SGI Indy, Indigo 2 and Challenge S with R4000, R4400, R4600 and R5000 processors are supported by the &debian; installation system on big endian MIPS. On SGI IP32, currently only systems based on the R5000 are supported.
fr: Sur SGI IP22, les plates-formes SGI Indy, Indigo 2 et Challenge S utilisant les processeurs R4000, R4400, R4600 et R5000 sont reconnues par le système d'installation de &debian; pour MIPS grand-boutien. Sur SGI IP32, seuls les systèmes basés sur le R5000 sont reconnus.

source: Some MIPS machines can be operated in both big and little endian mode. For little endian MIPS, please read the documentation for the mipsel architecture.
fr: Certaines machines MIPS peuvent fonctionner dans les modes grand-boutien ou petit-boutien. Pour les MIPS petit-boutien, veuillez-vous reporter à la documentation sur l'architecture «&nbsp;mipsel&nbsp;».

source: &debian; on &arch-title; supports the following platforms: <itemizedlist> <listitem><para> MIPS Malta: this platform is emulated by QEMU and is therefore a nice way to test and run &debian; on MIPS if you don't have the hardware. </para></listitem> </itemizedlist> Complete information regarding supported mips/mipsel machines can be found at the <ulink url="&url-linux-mips;">Linux-MIPS homepage</ulink>. In the following, only the systems supported by the &debian; installer will be covered. If you are looking for support for other subarchitectures, please contact the <ulink url="&url-list-subscribe;"> debian-&arch-listname; mailing list</ulink>.
fr: &debian; sur &arch-title; gère les plates-formes suivantes&nbsp;: <itemizedlist> <listitem><para> MIPS Malta&nbsp;: cette plate-forme est simulée par QEMU. C'est un bon moyen de tester &debian; sur ARM quand on ne possède pas le matériel. </para></listitem> </itemizedlist> Une information complète sur les machines mips/mipsel se trouve dans la <ulink url="&url-linux-mips;">page Linux-MIPS</ulink>. Dans la suite, seuls les systèmes gérés par l'installateur &debian; seront traités. Si vous recherchez de l'aide pour d'autres sous-architectures, vous pouvez contacter la <ulink url="&url-list-subscribe;">liste de diffusion debian-&arch-listname;</ulink>.

source: For &debian-gnu; &release; only the PMac (Power-Macintosh or PowerMac) and PreP subarchitectures are supported.
fr: Avec &debian-gnu; &release; seules les sous-architectures PMac (Power-Macintosh ou PowerMac) et PreP sont reconnues.

source: Kernel Flavours
fr: Les différents noyaux

source: There are two flavours of the powerpc kernel in &debian;, based on the CPU type:
fr: Il existe deux variantes du noyau powerpc, basées sur le type de processeur&nbsp;:

source: This kernel flavour supports the PowerPC 601, 603, 604, 740, 750, and 7400 processors. All Apple PowerMac machines up to and including the one marketed as G4 use one of these processors.
fr: Cette variante reconnaît les processeurs PowerPC 601, 603, 604, 740, 750 et 7400. Toutes les machines Apple PowerMac jusqu'à G4 utilisent l'un de ces processeurs.

source: All Apple PowerMac G4 SMP machines.
fr: Toutes les machines Apple PowerMac G4 SMP.

source: The power64 kernel flavour supports the following CPUs:
fr: La variante power64 acceptent les processeurs suivants&nbsp;:

source: The POWER3 processor is used in older IBM 64-bit server systems: known models include the IntelliStation POWER Model 265, the pSeries 610 and 640, and the RS/6000 7044-170, 7043-260, and 7044-270.
fr: Le processeur POWER3 est utilisé par les anciens systèmes IBM 64 bits. On trouve les machines IntelliStation POWER Model 265, les pSeries 610 et 640 et les RS/6000 7044-170, 7043-260, 7044-270.

source: The POWER4 processor is used in more recent IBM 64-bit server systems: known models include the pSeries 615, 630, 650, 655, 670, and 690.
fr: Le processeur POWER4 est utilisé par les nouveaux systèmes IBM 64 bits. On trouve les machines pSeries 615, 630, 650, 655, 670 et 690.

source: Systems using the PPC970 processor (Apple G5, YDL PowerStation, IBM Intellistation POWER 185) are also based on the POWER4 architecture, and use this kernel flavour.
fr: Les systèmes qui utilisent le processeur PPC970 (Apple G5, YDL PowerStation, IBM Intellistation POWER 185) sont aussi basés sur l'architecture POWER4 et utilise cette variante du noyau.

source: Newer IBM systems using POWER5, POWER6, and POWER7 processors.
fr: Les nouveaux systèmes IBM qui utilisent les processeurs POWER5, POWER6 et POWER7.

source: Power Macintosh (pmac) subarchitecture
fr: La sous-architecture Power Macintosh (pmac)

source: Apple (and briefly a few other manufacturers &mdash; Power Computing, for example) made a series of Macintosh computers based on the PowerPC processor. For purposes of architecture support, they are categorized as NuBus (not supported by &debian;), OldWorld, and NewWorld.
fr: Apple (et quelques autres constructeurs, Power Computing, par exemple), a produit une série d'ordinateurs Macintosh basés sur le processeur PowerPC. On distingue trois catégories&nbsp;: Nubus (non gérée par &debian;), OldWorld et NewWorld.

source: OldWorld systems are most Power Macintoshes with a floppy drive and a PCI bus. Most 603, 603e, 604, and 604e based Power Macintoshes are OldWorld machines. Those pre-iMac PowerPC models from Apple use a four digit naming scheme, except for the beige colored G3 systems, which are also OldWorld.
fr: Les systèmes OldWorld représentent la plupart des PowerMacintosh qui possèdent un lecteur de disquettes et un bus PCI. La plupart des Power Macintosh 603, 603e, 604 et 604e sont des machines OldWorld. Les numéros de modèles PowerPC pré-iMac de chez Apple ont quatre chiffres, sauf les systèmes G3 de couleur beige qui sont aussi des OldWorld.

source: The so called NewWorld PowerMacs are any PowerMacs in translucent colored plastic cases and later models. That includes all iMacs, iBooks, G4 systems, blue colored G3 systems, and most PowerBooks manufactured in and after 1999. The NewWorld PowerMacs are also known for using the <quote>ROM in RAM</quote> system for MacOS, and were manufactured from mid-1998 onwards.
fr: Les machines appelées PowerMac NewWorld sont les PowerMac avec un boîtier en plastique de couleur translucide&nbsp;: tous les iMac, iBook, G4, G3 de couleur bleue et la plupart des PowerBook fabriqués à partir de 1999. Les PowerMac NewWorld sont aussi connus pour utiliser le système <quote>Rom en Ram</quote> de MacOS et ont commencé à être fabriqués à partir de 1998.

source: Specifications for Apple hardware are available at <ulink url="http://www.info.apple.com/support/applespec.html">AppleSpec</ulink>, and, for older hardware, <ulink url="http://www.info.apple.com/support/applespec.legacy/index.html">AppleSpec Legacy</ulink>.
fr: Les spécifications pour le matériel Apple sont disponibles sur <ulink url="http://www.info.apple.com/support/applespec.html">AppleSpec</ulink>, et pour le matériel plus ancien, <ulink url="http://www.info.apple.com/support/applespec.legacy/index.html">AppleSpec Legacy</ulink>.

source: Model Name/Number
fr: Modèle Nom/Numéro

source: Generation
fr: Génération

source: PReP subarchitecture
fr: La sous-architecture PReP

source: CHRP subarchitecture
fr: La sous-architecture CHRP

source: APUS subarchitecture (unsupported)
fr: La sous-architecture APUS (non gérée)

source: Nubus PowerMac subarchitecture (unsupported)
fr: Sous-architecture Nubus PowerMac (non gérée)

source: NuBus systems are not currently supported by &debian;/powerpc. The monolithic Linux/PPC kernel architecture does not have support for these machines; instead, one must use the MkLinux Mach microkernel, which &debian; does not yet support. These include the following: <itemizedlist> <listitem><para> Power Macintosh 6100, 7100, 8100 </para></listitem> <listitem><para> Performa 5200, 6200, 6300 </para></listitem> <listitem><para> Powerbook 1400, 2300, and 5300 </para></listitem> <listitem><para> Workgroup Server 6150, 8150, 9150 </para></listitem> </itemizedlist> A linux kernel for these machines and limited support is available at <ulink url="http://nubus-pmac.sourceforge.net/"></ulink>.
fr: Les systèmes Nubus ne sont pas reconnus par &debian;/powerpc pour le moment. L'architecture monolithique du noyau Linux/PPC n'accepte pas ces machines&nbsp;; à la place, il faut utiliser le micronoyau MkLinux Mach, que &debian; ne gère pas encore. Cela inclut les modèles suivants&nbsp;: <itemizedlist> <listitem><para> Power Macintosh 6100, 7100, 8100 </para></listitem> <listitem><para> Performa 5200, 6200, 6300 </para></listitem> <listitem><para> Powerbook 1400, 2300, et 5300 </para></listitem> <listitem><para> Workgroup Server 6150, 8150, 9150 </para></listitem> </itemizedlist> Il existe un noyau Linux pour ces machines et on trouve un support limité sur <ulink url="http://nubus-pmac.sourceforge.net/"></ulink>.

source: Non-PowerPC Macs
fr: Mac non PowerPC

source: Macintosh computers using the 680x0 series of processors are <emphasis>not</emphasis> in the PowerPC family but are instead m68k machines. Those models start with <quote>Mac II</quote> series, go on to the <quote>LC</quote> family, then the Centris series, and culminate in the Quadras and Performas. These models usually have a Roman numeral or 3-digit model number such as Mac IIcx, LCIII or Quadra 950.
fr: Les ordinateurs Macintosh utilisant la série des microprocesseurs 680x0 n'appartiennent pas à la famille des PowerPC mais à celle des machines m68k. Ces modèles commencent avec les <quote>Mac II</quote>, continuent avec les <quote>LC</quote>, puis les <quote>Centris</quote> et les <quote>Quadra</quote> et <quote>Performa</quote>. Ces modèles ont un numéro à trois chiffres comme Mac IIcx, LCIII ou Quadra 950.

source: This model range started with the Mac II (Mac II, IIx, IIcx, IIci, IIsi, IIvi, IIvx, IIfx), then the LC (LC, LCII, III, III+, 475, 520, 550, 575, 580, 630), then the Mac TV, then the Centris (610, 650, 660AV), the Quadra (605, 610, 630, 650, 660AV, 700, 800, 840AV, 900, 950), and finally the Performa 200-640CD.
fr: Ces modèles commencent avec les Mac II (Mac II, IIx, IIcx, IIci, IIsi, IIvi, IIvx, IIfx), then the LC (LC, LCII, III, III+, 475, 520, 550, 575, 580, 630), puis les Mac TV, puis les Centris (610, 650, 660AV), les Quadra (605, 610, 630, 650, 660AV, 700, 800, 840AV, 900, 950), et en fin Performa 200-640CD.

source: In laptops, it started with the Mac Portable, then the PowerBook 100-190cs and the PowerBook Duo 210-550c (excluding PowerBook 500 which is Nubus, please see the section above).
fr: Pour les portables, ces modèles commencent avec le Mac Portable, puis les PowerBook 100-190cs et les PowerBook Duo 210-550c (en excluant le PowerBook 500, qui est de type Nubus, voyez la section ci-dessus.

source: zSeries and System z machine types
fr: Types de machine zSeries et System z

source: Since &debian; Squeeze, support for booting in ESA/390 mode was dropped. Your machine needs to support the z/Architecture, 64-bit support is mandatory. The userland of the s390 port is still compiled for ESA/390, though. All zSeries and System z hardware is fully supported. &arch-title; support software is included from the kernel 3.1 development stream. The most current information about IBM's Linux support can be found at the <ulink url="http://www.ibm.com/developerworks/linux/linux390/development_technical.html"> Linux on <trademark class="registered">System z</trademark> page on developerWorks</ulink>.
fr: Depuis la version Squeeze, la gestion du démarrage en mode ESA/390 a été abandonnée. Votre machine doit reconnaître au moins l'architecture z et le mode 64 bits est obligatoire. Toutes les applications du portage s390 sont encore compilées pour ESA/390. Toutes les machines zSeries et System z sont pleinement reconnues. Les logiciels pour &arch-title; sont inclus à partir de la version de développement du noyau 3.1. L'information la plus à jour sur la prise en charge de linux par IBM se trouve sur la <ulink url="http://www.ibm.com/developerworks/linux/linux390/development_technical.html"> page Linux sur <trademark class="registered">System z</trademark> sur developerWorks</ulink>.

source: PAV and HyperPAV
fr: PAV et HyperPAV

source: PAV and HyperPAV are supported transparently, multipathing is not needed to take advantage of these storage system features. Be sure to configure the devices during DASD device selection. The alias devices will not be offered neither for formatting, partitioning nor direct use.
fr: PAV et HyperPAV sont immédiatement reconnus ; le <quote>multipathing</quote> n'est pas nécessaire pour bénéficier des fonctionnalités de ces systèmes de stockage. Faites attention à configurer les périphériques lors de la sélection du DASD. Les périphériques <quote>alias</quote> ne sont pas proposés pour le formatage, le partitionnement ou une utilisation immédiate.

source: CPU and Main Boards Support
fr: Microprocesseurs et cartes mère

source: Sparc-based hardware is divided into a number of different subarchitectures, identified by one of the following names: sun4, sun4c, sun4d, sun4m, sun4u or sun4v. The following list describes what machines they include and what level of support may be expected for each of them.
fr: Le matériel Sparc comprend nombre de sous-architectures différentes, identifiées comme suit&nbsp;: sun4, sun4c, sun4d, sun4m, sun4u ou sun4v. La liste suivante indique les machines qui correspondent à ces architectures et dans quelle mesure elles sont gérées par &debian;.

source: None of these 32-bit sparc subarchitectures (sparc32) is supported. For a complete list of machines belonging to these subarchitectures, please consult the <ulink url="http://en.wikipedia.org/wiki/SPARCstation">Wikipedia SPARCstation page</ulink>.
fr: Aucune de ces sous-architectures 32 bits (sparc32) n'est gérée. La <ulink url="http://en.wikipedia.org/wiki/SPARCstation">page SPARCstation de Wikipedia</ulink> donne la liste de toutes les machines concernées.

source: The last &debian; release to support sparc32 was Etch, but even then only for sun4m systems. Support for the other 32-bits subarchitectures had already been discontinued after earlier releases.
fr: <emphasis>Etch</emphasis> est la dernière version de &debian; qui gère sparc32, et seulement les systèmes sun4m. Les autres sous-architectures 32 bits avaient été abandonnées lors de précédentes versions.

source: This subarchitecture includes all 64-bit machines (sparc64) based on the UltraSparc processor and its clones. Most of the machines are well supported, even though for some you may experience problems booting from CD due to firmware or bootloader bugs (this problem may be worked around by using netbooting). Use the sparc64 or sparc64-smp kernel in UP and SMP configurations respectively.
fr: Cette architecture comprend toutes les machines 64 bits (sparc64) basées sur le processeur UltraSparc et ses clones. La plupart de ces machines sont bien gérées même si vous pouvez rencontrer des problèmes lors de l'amorçage à partir d'un CD à cause de bogues dans le microprogramme ou dans le programme d'amorçage (on peut contourner ce problème en amorçant sur le réseau). Utilisez les noyaux sparc64 ou sparc64-smp selon que la machine possède un ou plusieurs processeurs.

source: This is the newest addition to the Sparc family, which includes machines based on the Niagara multi-core CPUs. At the moment such CPUs are only available in T1000 and T2000 servers by Sun, and are well supported. Use the sparc64-smp kernel.
fr: C'est la plus récente architecture de la famille Sparc. Elle comprend des machines basées sur les processeurs Niagara à plusieurs cœurs. Pour l'instant ces processeurs ne sont disponibles que sur les serveurs T1000 et T2000 de Sun. Ils sont correctement gérés. Utilisez le noyau sparc64-smp

source: Note that Fujitsu's SPARC64 CPUs used in PRIMEPOWER family of servers are not supported due to lack of support in the Linux kernel.
fr: Notez que les processeurs SPARC64 de Fujitsu utilisés dans la famille de serveurs PRIMEPOWER ne sont pas reconnus car ils ne sont pas gérés par le noyau Linux.

source: Laptops
fr: Portables

source: From a technical point of view, laptops are normal PCs, so all information regarding PC systems applies to laptops as well. Installations on laptops nowadays usually work out of the box, including things like automatically suspending the system on closing the lid and laptop specfic hardware buttons like those for disabling the wifi interfaces (<quote>airplane mode</quote>). Nonetheless sometimes the hardware vendors use specialized or proprietary hardware for some laptop-specific functions which might not be supported. To see if your particular laptop works well with GNU/Linux, see for example the <ulink url="&url-x86-laptop;">Linux Laptop pages</ulink>.
fr: D'un point de vue technique, les ordinateurs portables fonctionnent comme les autres PC et les informations concernant les PC s'appliquent aussi aux portables. L'installation de &debian; sur un portable se passe très bien. Des fonctionnalités comme la suspension automatique du système à la fermeture du couvercle ou la reconnaissance de boutons spécifiques aux portables comme celui pour désactiver l'interface wifi (mode « airplane ») sont correctement installées. Cependant quelques constructeurs utilisent du matériel propriétaire pour certaines fonctions, matériel qui n'est pas toujours reconnu. Pour vérifier que votre portable fonctionne bien avec GNU/Linux, consultez les <ulink url="&url-x86-laptop;">pages sur les portables sous Linux</ulink>.

source: Multiple Processors
fr: Processeurs multiples
