Repository: ferseiti/installation-guide
Catalog: po/*/hardware.po
Languages: fr

source: Multiprocessor support &mdash; also called <quote>symmetric multiprocessing</quote> or SMP &mdash; is available for this architecture. Having multiple processors in a computer was originally only an issue for high-end server systems but has become common in recent years nearly everywhere with the introduction of so called <quote>multi-core</quote> processors. These contain two or more processor units, called <quote>cores</quote>, in one physical chip.
fr: Cette architecture accepte les systèmes à plusieurs processeurs (<quote>symmetric multiprocessing</quote> ou SMP). À l'origine, sur certains serveurs haut de gamme, un système à multiples processeurs pouvait provoquer des problèmes. Aujourd'hui, un simple ordinateur de bureau ou un portable possède plusieurs processeurs sous la forme d'un processeur multicœur, une puce contenant deux processeurs ou plus, appelés cœur.

source: The standard &debian; &release; kernel image has been compiled with SMP support. It is also usable on non-SMP systems without problems.
fr: L'image standard du noyau &debian; &release; a été compilée avec SMP mais elle est parfaitement utilisable sur les systèmes non-SMP.

source: Multiprocessor support &mdash; also called <quote>symmetric multiprocessing</quote> or SMP &mdash; is available for this architecture. The standard &debian; &release; kernel image has been compiled with <firstterm>SMP-alternatives</firstterm> support. This means that the kernel will detect the number of processors (or processor cores) and will automatically deactivate SMP on uniprocessor systems.
fr: Cette architecture accepte les systèmes à plusieurs processeurs (<quote>symmetric multiprocessing</quote> ou SMP). L'image standard du noyau &debian; &release; a été compilée avec l'option <firstterm>SMP-alternatives</firstterm>. Le noyau détectera si votre système possède plusieurs processeurs et désactivera automatiquement la gestion SMP sur les systèmes avec un seul processeur.

source: Having multiple processors in a computer was originally only an issue for high-end server systems but has become common in recent years nearly everywhere with the introduction of so called <quote>multi-core</quote> processors. These contain two or more processor units, called <quote>cores</quote>, in one physical chip.
fr: À l'origine, sur certains serveurs haut de gamme, un système à multiples processeurs pouvait provoquer des problèmes. Aujourd'hui, un simple ordinateur de bureau ou un portable possède plusieurs processeurs sous la forme d'un processeur multicœur, une puce contenant deux processeurs ou plus, appelés cœur.

source: The 586 flavour of the &debian; kernel image packages for &arch-title; is not compiled with SMP support.
fr: Pour l'architecture &arch-title;, la variante 586 de l'image &debian; du noyau n'est pas compilée avec l'option SMP.

source: Multiprocessor support &mdash; also called <quote>symmetric multiprocessing</quote> or SMP &mdash; is available for this architecture. However, the standard &debian; &release; kernel image does not support SMP. This should not prevent installation, since the standard, non-SMP kernel should boot on SMP systems; the kernel will simply use only the first CPU.
fr: Cette architecture accepte les systèmes à plusieurs processeurs (<quote>symmetric multiprocessing</quote> ou SMP). Cependant, l'image standard du noyau &debian; &release; ne reconnaît pas le SMP. Cela ne devrait pas empêcher l'installation, puisque le noyau non-SMP devrait démarrer sur les systèmes SMP, le noyau utilisera simplement le premier CPU.

source: In order to take advantage of multiple processors, you'll have to replace the standard &debian; kernel.<phrase arch="linux-any"> You can find a discussion of how to do this in <xref linkend="kernel-baking"/>. At this time (kernel version &kernelversion;) the way you enable SMP is to select <quote>&smp-config-option;</quote> in the <quote>&smp-config-section;</quote> section of the kernel config.</phrase>
fr: Afin de tirer profit de plusieurs processeurs, vous devrez remplacer le noyau standard &debian;. <phrase arch="linux-any">Vous trouverez une discussion sur la façon de faire dans la <xref linkend="kernel-baking"/>. Aujourd'hui, (version &kernelversion; du noyau) la façon d'activer SMP est de choisir <quote>&smp-config-option;</quote> dans la section <quote>&smp-config-section;</quote> quand on configure le noyau.</phrase>

source: Multiprocessor support &mdash; also called <quote>symmetric multiprocessing</quote> or SMP &mdash; is available for this architecture, and is supported by a precompiled &debian; kernel image. Depending on your install media, this SMP-capable kernel may or may not be installed by default. This should not prevent installation, since the standard, non-SMP kernel should boot on SMP systems; the kernel will simply use the first CPU.
fr: Cette architecture accepte les systèmes à plusieurs processeurs (<quote>symmetric multiprocessing</quote> ou SMP). Une image standard du noyau &debian; &release; a été compilée avec SMP. Selon votre support d'installation, ce noyau peut ou non être installé par défaut. Cela ne devrait pas empêcher l'installation, puisque le noyau non-SMP devrait démarrer sur les systèmes SMP&nbsp;; le noyau utilisera simplement le premier processeur.

source: In order to take advantage of multiple processors, you should check to see if a kernel package that supports SMP is installed, and if not, choose an appropriate kernel package.
fr: Afin de tirer profit de plusieurs processeurs, vous devrez vérifier que le noyau installé accepte le SMP ou bien vous en installerez un.

source: You can also build your own customized kernel to support SMP.<phrase arch="linux-any"> You can find a discussion of how to do this in <xref linkend="kernel-baking"/>. At this time (kernel version &kernelversion;) the way you enable SMP is to select <quote>&smp-config-option;</quote> in the <quote>&smp-config-section;</quote> section of the kernel config.</phrase>
fr: Vous pouvez aussi compiler vous-même un noyau avec SMP. <phrase arch="linux-any">Vous trouverez une discussion sur la façon de faire dans la <xref linkend="kernel-baking"/>. Aujourd'hui (version &kernelversion; du noyau) la façon d'activer SMP est de choisir <quote>&smp-config-option;</quote> dans la section <quote>&smp-config-section;</quote> quand on configure le noyau.</phrase>

source: Graphics Card Support
fr: Gestion des cartes graphiques

source: &debian;'s support for graphical interfaces is determined by the underlying support found in X.Org's X11 system. On modern PCs, having a graphical display usually works out of the box. Whether advanced graphics card features such as 3D-hardware acceleration or hardware-accelerated video are available, depends on the actual graphics hardware used in the system and in some cases on the installation of additional <quote>firmware</quote> images (see <xref linkend="hardware-firmware"/>). In very few cases there have been reports about hardware on which installation of additional graphics card firmware was required even for basic graphics support, but these have been rare exceptions.
fr: &debian; reconnaît les interfaces graphiques dans la mesure où elles sont reconnues par le système X11 de X.Org. Sur les ordinateurs modernes, tout environnement graphique fonctionne sans problème. Certaines fonctionnalités avancées des cartes graphiques, comme l'accélération 3D ou l'accélération matérielle (<emphasis>hardware-accelerated video</emphasis>), dépendent parfois de la carte graphique installée et demandent l'installation de microprogrammes supplémentaires, voyez la <xref linkend="hardware-firmware"/>. Dans de très rares cas, il a été noté que certains matériels demandaient l'installation de microprogrammes même pour les fonctionnalités de base de la carte graphique.

source: Details on supported graphics cards and pointing devices can be found at <ulink url="&url-xorg;"></ulink>. &debian; &release; ships with X.Org version &x11ver;.
fr: Des précisions sur les cartes graphiques acceptées et les dispositifs de pointage sont disponibles sur <ulink url="&url-xorg;"></ulink>. &debian; &release; propose la version &x11ver; de X.Org.

source: The X.Org X Window System is only supported on the SGI Indy and the O2.
fr: Le système X window de X.Org n'est disponible pour le moment que sur SGI Indy et O2.

source: Most graphics options commonly found on Sparc-based machines are supported. X.org graphics drivers are available for sunbw2, suncg14, suncg3, suncg6, sunleo and suntcx framebuffers, Creator3D and Elite3D cards (sunffb driver), PGX24/PGX64 ATI-based video cards (ati driver), and PermediaII-based cards (glint driver). To use an Elite3D card with X.org you additionally need to install the <classname>afbinit</classname> package, and read the documentation included with it on how to activate the card.
fr: La plupart des options graphiques communes des machines basées sur Sparc sont gérées. Les pilotes de X.org sont disponibles pour sunbw2, suncg14, suncg3, suncg6, sunleo et suntcx framebuffers, les cartes Creator3D et Elite3D (pilote sunffb), les cartes ATI PGX24/PGX64 (pilote ati), et les cartes PermediaII (pilote glint). Pour utiliser une carte Elite3D avec X.org vous devez aussi installer le paquet <classname>afbinit</classname> et lire la documentation pour savoir comment activer la carte.

source: It is not uncommon for a Sparc machine to have two graphics cards in a default configuration. In such a case there is a possibility that the Linux kernel will not direct its output to the card initially used by the firmware. The lack of output on the graphical console may then be mistaken for a hang (usually the last message seen on console is 'Booting Linux...'). One possible solution is to physically remove one of the video cards; another option is to disable one of the cards using a kernel boot parameter. Also, if graphical output is not required or desired, serial console may be used as an alternative. On some systems use of serial console can be activated automatically by disconnecting the keyboard before booting the system.
fr: Il n'est pas exceptionnel qu'une machine Sparc possède deux cartes graphiques en configuration normale. Il se peut alors que le noyau Linux ne dirige pas la sortie vidéo vers la carte utilisée par le microprogramme. L'absence de sortie vidéo sur la console graphique peut être confondue avec un arrêt (habituellement le dernier message vu sur la console est <quote>Booting Linux...</quote>). Une solution possible est d'enlever l'une des cartes vidéo. Une autre solution est de désactiver l'une des cartes avec un paramètre passé au noyau. Quand la sortie vidéo n'est pas nécessaire ou souhaitée, on peut utiliser une console série. Sur certains systèmes, on peut activer automatiquement la console série en déconnectant le clavier avant d'amorcer le système.

source: Network Connectivity Hardware
fr: Matériel de connexion réseau

source: Almost any network interface card (NIC) supported by the &arch-kernel; kernel should also be supported by the installation system; drivers should normally be loaded automatically. <phrase arch="x86">This includes most PCI/PCI-Express cards as well as PCMCIA/Express Cards on laptops.</phrase> <phrase arch="i386">Many older ISA cards are supported as well.</phrase>
fr: Toute carte réseau (<emphasis>NIC, network interface card</emphasis>) reconnue par le noyau &arch-kernel; devrait aussi être reconnue par l'installateur. Les pilotes devraient être chargés de manière automatique. <phrase arch="x86">La plupart des cartes PCI/PCI-Express sont reconnues ainsi que les cartes PCMCIA/Express pour les portables.</phrase> <phrase arch="i386">Beaucoup d'anciennes cartes ISA le sont aussi.</phrase>

source: This includes a lot of generic PCI cards (for systems that have PCI) and the following NICs from Sun:
fr: Beaucoup de cartes PCI génériques sont reconnues, ainsi que les cartes SUN suivantes&nbsp;:

source: The list of supported network devices is:
fr: La liste des cartes réseau reconnues est&nbsp;:

source: Channel to Channel (CTC) and ESCON connection (real or emulated)
fr: Channel to Channel (CTC) et ESCON connection (réelle ou émulée).

source: OSA-2 Token Ring/Ethernet and OSA-Express Fast Ethernet (non-QDIO)
fr: OSA-2 Token Ring/Ethernet et OSA-Express Fast Ethernet (non-QDIO)

source: OSA-Express in QDIO mode, HiperSockets and Guest-LANs
fr: OSA-Express en mode QDIO, HiperSockets et Guest-LANs

source: On &arch-title;, most built-in Ethernet devices are supported and modules for additional PCI and USB devices are provided.
fr: Sur &arch-title;, la plupart des périphériques Ethernet intégrés sont reconnus et des modules pour les périphériques USB et PCI sont fournis.

source: ISDN is supported, but not during the installation.
fr: Le RNIS ne peut pas être utilisé pour l'installation.

source: Wireless Network Cards
fr: Cartes réseau sans fil

source: Wireless networking is in general supported as well and a growing number of wireless adapters are supported by the official &arch-kernel; kernel, although many of them do require firmware to be loaded.
fr: Les cartes réseau sans fil sont en général reconnues et le noyau &arch-kernel; officiel reconnaît un nombre croissant d'adaptateurs. Cependant beaucoup d'entre eux demandent le chargement d'un microprogramme.

source: If firmware is needed, the installer will prompt you to load firmware. See <xref linkend="loading-firmware"/> for detailed information on how to load firmware during the installation.
fr: Quand un microprogramme est nécessaire, l'installateur vous demandera de le télécharger. Consultez la <xref linkend="loading-firmware"/> pour des informations détaillées sur la manière de télécharger un microprogramme pendant l'installation.

source: Wireless NICs that are not supported by the official &arch-kernel; kernel can generally be made to work under &debian-gnu;, but are not supported during the installation.
fr: On peut faire fonctionner des cartes non reconnues par le noyau &arch-kernel; officiel avec &debian-gnu;, mais elles ne sont pas gérées pendant l'installation.

source: If there is a problem with wireless and there is no other NIC you can use during the installation, it is still possible to install &debian-gnu; using a full CD-ROM or DVD image. Select the option to not configure a network and install using only the packages available from the CD/DVD. You can then install the driver and firmware you need after the installation is completed (after the reboot) and configure your network manually.
fr: Si vous ne pouvez pas utiliser d'autre carte pour l'installation, vous pouvez toujours installer &debian-gnu; avec un CD ou un DVD. Choisissez l'option de ne pas configurer le réseau et utilisez seulement les paquets qui se trouvent sur le CD. Une fois l'installation terminée (après le réamorçage), vous pourrez charger le pilote et le microprogramme dont vous avez besoin et configurer le réseau.

source: In some cases the driver you need may not be available as a &debian; package. You will then have to look if there is source code available in the internet and compile the driver yourself. How to do this is outside the scope of this manual. <phrase arch="x86">If no Linux driver is available, your last resort is to use the <classname>ndiswrapper</classname> package, which allows you to use a Windows driver.</phrase>
fr: Parfois, le pilote nécessaire n'est pas disponible sous forme de paquet &debian;. Il faudra chercher le code source sur internet et le compiler vous-même. Comment procéder dépasse le cadre de ce manuel. <phrase arch="x86">S'il n'existe pas de pilote pour Linux, vous pouvez toujours utiliser le paquet <classname>ndiswrapper</classname> qui permet d'installer un pilote Windows.</phrase>

source: Known Issues for &arch-title;
fr: Problèmes connus sur &arch-title;

source: There are a couple of issues with specific network cards that are worth mentioning here.
fr: Quelques cartes réseau spéciales posent des problèmes qui méritent d'être mentionnés.

source: Conflict between tulip and dfme drivers
fr: Conflits entre les pilotes tulip et dfme

source: There are various PCI network cards that have the same PCI identification, but are supported by related, but different drivers. Some cards work with the <literal>tulip</literal> driver, others with the <literal>dfme</literal> driver. Because they have the same identification, the kernel cannot distinguish between them and it is not certain which driver will be loaded. If this happens to be the wrong one, the NIC may not work, or work badly.
fr: Certaines cartes PCI ont la même identité mais sont gérées par des pilotes différents. Certaines sont gérées par le pilote <literal>tulip</literal> et d'autres par le pilote <literal>dfme</literal>. Comme elles ont la même identité, le noyau ne les distingue pas et peut charger le mauvais pilote.

source: This is a common problem on Netra systems with a Davicom (DEC-Tulip compatible) NIC. In that case the <literal>tulip</literal> driver is probably the correct one. You can prevent this issue by blacklisting the wrong driver module as described in <xref linkend="module-blacklist"/>.
fr: C'est un problème connu sur les systèmes Netra avec une carte Davicom (DEC-Tulip). Dans ce cas, le pilote <literal>tulip</literal> est correct. Pour éviter ce problème, il faut mettre le module défectueux sur liste noire. Voyez la <xref linkend="module-blacklist"/>.

source: An alternative solution during the installation is to switch to a shell and unload the wrong driver module using <userinput>modprobe -r <replaceable>module</replaceable></userinput> (or both, if they are both loaded). After that you can load the correct module using <userinput>modprobe <replaceable>module</replaceable></userinput>. Note that the wrong module may then still be loaded when the system is rebooted.
fr: Pendant l'installation, la solution est de passer sur un interpréteur de commande et de supprimer le mauvais pilote (ou les deux, si les deux sont chargés) avec <userinput>modprobe -r <replaceable>module</replaceable></userinput>. Ensuite, il suffit de charger le bon pilote avec <userinput>modprobe <replaceable>module</replaceable></userinput>. Il se peut malgré tout que le mauvais module soit chargé quand le système est redémarré.

source: The <literal>cassini</literal> network driver does not work with Sun B100 blade systems.
fr: Le pilote réseau <literal>cassini</literal> ne fonctionne pas avec les systèmes Sun B100 blade.

source: Braille Displays
fr: Les plages Braille

source: Support for braille displays is determined by the underlying support found in <classname>brltty</classname>. Most displays work under <classname>brltty</classname>, connected via either a serial port, USB or bluetooth. Details on supported braille devices can be found on the <ulink url="&url-brltty;"><classname>brltty</classname> website</ulink>. &debian-gnu; &release; ships with <classname>brltty</classname> version &brlttyver;.
fr: La gestion des plages Braille dépend de <classname>brltty</classname>. La plupart des plages fonctionnent avec <classname>brltty</classname>, connecté par un port série, un port USB ou un port bluetooth. Des précisions sur les plages fonctionnelles se trouvent sur le <ulink url="&url-brltty;">site de <classname>brltty</classname></ulink>. &debian-gnu; &release; propose la version &brlttyver; de <classname>brltty</classname>.

source: Hardware Speech Synthesis
fr: Synthèse vocale matérielle

source: Support for hardware speech synthesis devices is determined by the underlying support found in <classname>speakup</classname>. <classname>speakup</classname> only supports integrated boards and external devices connected to a serial port (no USB, serial-to-USB or PCI adapters are supported). Details on supported hardware speech synthesis devices can be found on the <ulink url="&url-speakup;"><classname>speakup</classname> website</ulink>. &debian-gnu; &release; ships with <classname>speakup</classname> version &speakupver;.
fr: La synthèse vocale matérielle est prise en charge par <classname>speakup</classname>. <classname>speakup</classname> n'accepte que les cartes intégrées et les périphériques externes connectés par un port série, (pas d'adaptateurs USB, serial-to-USB ou PCI). On peut trouver des précisions sur la synthèse vocale matérielle sur le <ulink url="&url-speakup;">site de <classname>speakup</classname></ulink>. &debian-gnu; &release; propose la version &speakupver; de <classname>speakup</classname>.

source: Peripherals and Other Hardware
fr: Périphériques et autres matériels

source: &arch-kernel; supports a large variety of hardware devices such as mice, printers, scanners, PCMCIA/CardBus/ExpressCard and USB devices. However, most of these devices are not required while installing the system.
fr: &arch-kernel; reconnaît une large gamme de périphériques comme les souris, les imprimantes, les scanners, les modems, les cartes réseau, les périphériques PCMCIA/CardBus/ExpressCard et USB, etc. Cependant, aucun de ces périphériques n'est requis lors de l'installation du système.

source: USB hardware generally works fine. On some very old PC systems some USB keyboards may require additional configuration (see <xref linkend="hardware-issues"/>). On modern PCs, USB keyboards and mice work without requiring any specific configuration.
fr: Le matériel USB fonctionne correctement. Pour quelques très anciens PC, les claviers USB peuvent nécessiter une configuration supplémentaire (voyez la <xref linkend="hardware-issues"/>). Sur les ordinateurs modernes, claviers et souris USB ne demandent aucune configuration particulière.

source: Package installations from XPRAM and tape are not supported by this system. All packages that you want to install need to be available on a DASD or over the network using NFS, HTTP or FTP.
fr: Les installations de paquets à partir de XPRAM ou d'une bande ne sont pas reconnues par le système. Tous les paquets que vous désirez installer doivent être disponibles sur un DASD ou bien sur le réseau avec NFS, HTTP ou FTP.

source: Devices Requiring Firmware
fr: Périphériques demandant des microprogrammes (<emphasis>firmware</emphasis>)

source: Besides the availability of a device driver, some hardware also requires so-called <firstterm>firmware</firstterm> or <firstterm>microcode</firstterm> to be loaded into the device before it can become operational. This is most common for network interface cards (especially wireless NICs), but for example some USB devices and even some hard disk controllers also require firmware. With many graphics cards, basic functionality is available without additional firmware, but the use of advanced features requires an appropriate firmware file to be installed in the system.
fr: Outre la disponibilité d'un pilote, certains périphériques exigent le chargement d'un <firstterm>microprogramme</firstterm> pour fonctionner. C'est le cas pour les cartes réseau (particulièrement les cartes réseau sans fil), mais certains périphériques USB ou certains contrôleurs de disque dur demandent des microprogrammes. Pour les cartes graphiques, les fonctionnalités de base ne demandent pas de microprogramme supplémentaire, contrairement aux fonctionnalités avancées qui demandent l'installation sur le système d'un microprogramme spécifique.
