Repository: ferseiti/installation-guide
Catalog: po/*/hardware.po
Languages: fr

source: System Requirements
fr: Configuration nécessaire

source: This section contains information about what hardware you need to get started with &debian;. You will also find links to further information about hardware supported by GNU and &arch-kernel;.
fr: Cette section contient des informations sur le matériel dont vous avez besoin pour commencer avec &debian;. Vous trouverez aussi des liens vers des informations supplémentaires concernant le matériel reconnu par GNU et &arch-kernel;.

source: Supported Hardware
fr: Matériel reconnu

source: &debian; does not impose hardware requirements beyond the requirements of the Linux or kFreeBSD kernel and the GNU tool-sets. Therefore, any architecture or platform to which the Linux or kFreeBSD kernel, libc, <command>gcc</command>, etc. have been ported, and for which a &debian; port exists, can run &debian;. Please refer to the Ports pages at <ulink url="&url-ports;"></ulink> for more details on &arch-title; architecture systems which have been tested with &debian-gnu;.
fr: En ce qui concerne le matériel, &debian; n'a pas plus d'exigences que le noyau Linux ou kFreeBSD et les outils GNU. Par conséquent, toute architecture ou plate-forme sur laquelle le noyau Linux ou kFreeBSD, la libc, le compilateur gcc, etc. ont été portés, et pour laquelle un portage de &debian; existe, peut faire fonctionner &debian;. Reportez-vous aux pages sur les portages <ulink url="&url-ports;"></ulink> pour plus de précisions concernant les systèmes d'architecture &arch-title; qui ont été testés avec &debian-gnu;.

source: Rather than attempting to describe all the different hardware configurations which are supported for &arch-title;, this section contains general information and pointers to where additional information can be found.
fr: Plutôt que d'essayer de décrire les différentes configurations matérielles acceptées par &arch-title;, cette section contient des informations générales et des liens vers des informations complémentaires.

source: Supported Architectures
fr: Architectures reconnues

source: &debian; GNU/Linux &release; supports eight major architectures and several variations of each architecture known as <quote>flavors</quote>.
fr: &debian; GNU/Linux &release; fonctionne sur huit architectures principales et sur de nombreuses variantes de celles-ci, appelées <quote>saveurs</quote>.

source: &debian; Designation
fr: Étiquette &debian;

source: Subarchitecture
fr: Sous-Architecture

source: Flavor
fr: Saveur

source: ARM with hardware FPU
fr: ARM avec matériel FPU

source: multiplatform
fr: multiplate-forme

source: multiplatform for LPAE-capable systems
fr: multiplate-forme pour les systèmes à extension d'adressage (LPAE)

source: 64bit ARM
fr: ARM 64 bits

source: MIPS (big endian)
fr: MIPS (grand boutien)

source: MIPS Malta (32 bit)
fr: MIPS Malta (32 bits)

source: MIPS Malta (64 bit)
fr: MIPS Malta (64 bits)

source: MIPS (little endian)
fr: MIPS (petit boutien)

source: IBM PowerPC (little endian)
fr: IBM PowerPC (petit boutien)

source: 64bit IBM S/390
fr: IBM S/390 64 bits

source: IPL from VM-reader and DASD
fr: IPL avec lecteur de machine virtuelle (VM-reader) et accès direct au périphérique de stockage (DASD)

source: &debian; GNU/kFreeBSD &release; supports two architectures.
fr: &debian; GNU/kFreeBSD &release; fonctionne sur deux architectures.

source: This document covers installation for the <emphasis>&arch-title;</emphasis> architecture using the <emphasis>&arch-kernel;</emphasis> kernel. If you are looking for information on any of the other &debian;-supported architectures take a look at the <ulink url="http://www.debian.org/ports/">&debian;-Ports</ulink> pages.
fr: Ce document décrit l'installation pour l'architecture <emphasis>&arch-title;</emphasis> avec le noyau <emphasis>&arch-kernel;</emphasis>. Des versions pour les autres architectures disponibles existent sur les pages <ulink url="http://www.debian.org/ports/">Debian-Ports</ulink>.

source: The &arch-title; architecture only supports Intel Itanium processors and not the much more common 64-bit processors from the Intel 64 family (including e.g. the Pentium&nbsp;D and the Core2&nbsp;Duo). Those systems are supported by the <emphasis>amd64</emphasis> architecture or, if you prefer a 32-bit userland, the <emphasis>i386</emphasis> architecture.
fr: L'architecture &arch-title; fonctionne seulement sur les processeurs Itanium d'Intel. Elle ne fonctionne pas sur les processeurs 64 bits plus communs appartenant à la famille Intel 64, comme le Pentium&nbsp;D ou le Core2&nbsp;Duo. Ces systèmes fonctionnent avec l'architecture <emphasis>amd64</emphasis> ou si vous préférez le mode 32 bits, avec l'architecture <emphasis>i386</emphasis>.

source: This is the first official release of &debian-gnu; for the &arch-title; architecture. We feel that it has proven itself sufficiently to be released. However, because it has not had the exposure (and hence testing by users) that some other architectures have had, you may encounter a few bugs. Use our <ulink url="&url-bts;">Bug Tracking System</ulink> to report any problems; make sure to mention the fact that the bug is on the &arch-title; platform using the <emphasis>&arch-kernel;</emphasis> kernel. It can be necessary to use the <ulink url="&url-list-subscribe;">debian-&arch-listname; mailing list</ulink> as well.
fr: Voici la première version officielle de &debian-gnu; pour l'architecture &arch-title;. Nous pensons que le portage a fait ses preuves et qu'il peut être rendu public. Cependant, comme il n'a pas encore été soumis à la <quote>vraie vie</quote> (ni testé par d'autres utilisateurs) comme l'ont été d'autres architectures, vous pourriez rencontrer quelques bogues. Utilisez notre <ulink url="&url-bts;">système de suivi des bogues</ulink> pour signaler les problèmes&nbsp;; n'oubliez pas de mentionner que le bogue s'est produit sur une plate-forme &arch-title;. Et prévenez aussi la <ulink url="&url-list-subscribe;">liste de diffusion debian-&arch-listname;</ulink>.

source: CPU Support
fr: Microprocesseurs

source: Both AMD64 and Intel 64 processors are supported.
fr: Les processeurs AMD64 et Intel 64 sont reconnus.

source: CPU, Main Boards, and Video Support
fr: Microprocesseurs, cartes mère et cartes vidéo

source: ARM systems are a lot more heterogenous than the i386/amd64-based PC architecture, where all systems share a common system firmware (BIOS or/and UEFI) which handles the board-specific basic hardware initialization in a standardized way. The ARM architecture is used mainly in so-called <quote>systems-on-chip</quote> (SOCs). These SOCs are designed by many different companies with vastly varying hardware components even for the very basic functionality required to bring the system up. Systems using them usually lack a common system firmware interface and as a result, on ARM systems the Linux kernel has to take care of many system-specific low-level issues which are handled by the mainboard's BIOS in the PC world.
fr: Les systèmes ARM sont beaucoup plus hétérogènes que l'architecture PC de type i386/amd64, où tous les systèmes ont un microprogramme commun (BIOS et/ou UEFI) qui s'occupe de toute la partie spécifique à l'initialisation du matériel d'une façon standardisée. L'architecture ARM est utilisée surtout dans les systèmes sur puce (<quote>systems-on-chip</quote> (SOC)). Ces SOC sont conçus par différentes entreprises, avec une grande diversité de composants matériels, même pour les fonctionnalités les plus élémentaires nécessaires pour démarrer le système. Ces systèmes n'ont généralement pas de microprogramme commun et la conséquence est que le noyau Linux, sur les systèmes ARM, doit s'occuper de tous les problèmes de bas niveau liés au matériel, qui sont gérés par le BIOS de la carte mère dans le monde PC.

source: At the beginning of the ARM support in the Linux kernel, this resulted in the requirement of having a seperate kernel for each ARM system in contrast to the <quote>one-fits-all</quote> kernel for PC systems. As this approach does not scale to a large number of different systems, work has started to be able to provide a single ARM kernel that can run on different ARM systems. Support for newer ARM systems gets implemented in a way that allows the use of such a multiplatform kernel, but for several older systems a seperate specific kernel is still required. Because of this, the standard &debian; distribution only supports installation on a selected number of older ARM systems in addition to the newer systems which are supported by the ARM multiplatform (armmp) kernel.
fr: Au début de la prise en charge d'ARM dans le noyau Linux, cela conduisait à avoir un noyau différent pour chaque système ARM, à l'opposé de l'approche <quote>one-fits-all</quote> pour le noyau des systèmes de type PC. Comme cette approche ne s'adaptait pas bien à un grand nombre de systèmes différents, un travail a commencé pour fournir un noyau ARM unique qui pourrait s'exécuter sur différents systèmes. La prise en charge de nouveaux systèmes est implémentée de manière à avoir un tel noyau multiplate-forme, mais pour plusieurs anciens systèmes, un noyau spécifique est toujours nécessaire. À cause de cela, la distribution &debian; ne prend en charge qu'un certain nombre d'anciens systèmes ARM, en plus des nouveaux pris en charge par le noyau ARM multiplate-forme (armmp).

source: The ARM architecture has evolved over time and modern ARM processors provide features which are not available in older models. &debian; therefore provides two ARM ports, the &debian;/armel and the &debian;/armhf port. &debian;/armel targets older ARM processors without support for a hardware floating point unit (FPU), while &debian;/armhf works only on newer ARM processors which implement at least the ARMv7 architecture with version 3 of the ARM vector floating point specification (VFPv3). &debian;/armhf makes use of the extended features and performance enhancements available on these models.
fr: L'architecture ARM a évolué, et les processeurs ARM récents fournissent des fonctionnalités qui ne sont pas disponibles pour les anciens modèles. &debian; fournit deux portages ARM, &debian;/armel et &debian;/armhf. &debian;/armel est destiné aux anciens processeurs ARM sans prise en charge de la virgule flottante au niveau matériel (<quote>hardware floating point unit (FPU)</quote>), alors que &debian;/armhf ne fonctionne que sur les nouveaux processeurs qui implémentent au moins l'architecture ARMv7 et la version 3 des spécifications de virgule flottante (VFPv3). &debian;/armhf utilise les fonctionnalités étendues et les améliorations de performance de ces modèles.

source: Technically, several ARM CPUs can be run in either endian mode (big or little), but in practice the vast majority of currently available systems uses little-endian mode. Both &debian;/armhf and &debian;/armel support only little-endian systems.
fr: Techniquement, la plupart des CPU ARM peuvent fonctionner en mode petit-boutien ou en mode grand-boutien. Cependant les systèmes les plus courants utilisent le mode petit-boutien. &debian;/armel et &debian;/armhf fonctionnent tous les deux uniquement sur les processeurs ARM petit-boutiens.

source: Platforms supported by Debian/armel
fr: Plates-formes prises en charge par Debian/armel

source: The following platforms are supported by &debian;/armel; they require platform-specific kernels.
fr: Les plates-formes suivantes sont prises en charge par &debian;/armel ; elles nécessitent un noyau spécifique à la plate-forme.

source: The Intel IXP4xx processor series is used in network attached storage devices like the Linksys NSLU2.
fr: La série de processeurs IXP4xx de Intel est utilisée dans les périphériques de stockage réseau (NAS, network attached storage) comme le Linksys NSLU2.

source: Kirkwood is a system on a chip (SoC) from Marvell that integrates an ARM CPU, Ethernet, SATA, USB, and other functionality in one chip. We currently support the following Kirkwood based devices: OpenRD (OpenRD-Base, OpenRD-Client and OpenRD-Ultimate), <ulink url="&url-arm-cyrius-sheevaplug;">plug computers (SheevaPlug, GuruPlug and DreamPlug)</ulink>, <ulink url="&url-arm-cyrius-qnap-kirkwood;">QNAP Turbo Station</ulink> (all TS-11x, TS-21x and TS-41x models), and LaCie NASes (Network Space v2, Network Space Max v2, Internet Space v2, d2 Network v2, 2Big Network v2 and 5Big Network v2).
fr: Kirkwood est un système sur une puce (SOC) de Marvell qui comporte un processeur ARM, Ethernet, SATA, USB, et d'autres fonctionnalités sur une seule puce. Pour l'instant sont reconnus les systèmes suivants : OpenRD (OpenRD-Base, OpenRD-Client et OpenRD-Ultimate), <ulink url="&url-arm-cyrius-sheevaplug;">plug computers (SheevaPlug, GuruPlug and DreamPlug)</ulink>, <ulink url="&url-arm-cyrius-qnap-kirkwood;">QNAP Turbo Station</ulink> (tous les modèles TS-11x, TS-21x et TS-41x), et LaCie NASes (Network Space v2, Network Space Max v2, Internet Space v2, d2 Network v2, 2Big Network v2 et 5Big Network v2).

source: Orion is a system on a chip (SoC) from Marvell that integrates an ARM CPU, Ethernet, SATA, USB, and other functionality in one chip. There are many Network Attached Storage (NAS) devices on the market that are based on an Orion chip. We currently support the following Orion based devices: <ulink url="&url-arm-cyrius-kuroboxpro;">Buffalo Kurobox</ulink>, <ulink url="&url-arm-cyrius-dns323;">D-Link DNS-323</ulink> and <ulink url="&url-arm-cyrius-mv2120;">HP mv2120</ulink>.
fr: Orion est un système sur une puce (SOC) de Marvell qui intègre processeur ARM, Ethernet, SATA, USB et autres fonctionnalités sur une seule puce. Il existe sur le marché beaucoup de périphériques NAS (<quote>Network Attached Storage</quote>) basés sur la puce Orion. Pour l'instant sont reconnus les systèmes suivants : <ulink url="&url-arm-cyrius-kuroboxpro;">Buffalo Kurobox</ulink>, <ulink url="&url-arm-cyrius-dns323;">D-Link DNS-323</ulink> et <ulink url="&url-arm-cyrius-mv2120;">HP mv2120</ulink>.

source: The Versatile platform is emulated by QEMU and is therefore a nice way to test and run &debian; on ARM if you don't have the hardware.
fr: La plate-forme <quote>Versatile</quote> est émulée par QEMU. C'est un bon moyen de tester &debian; sur ARM quand on ne possède pas le matériel.

source: Platforms no longer supported by Debian/armel
fr: Plates-formes qui ne sont plus prises en charge par Debian/armel

source: Intel's I/O Processor (IOP) line is found in a number of products related to data storage and processing, such as the <ulink url="&url-arm-cyrius-glantank;">GLAN Tank</ulink> from IO-Data and the <ulink url="&url-arm-cyrius-n2100;">Thecus N2100</ulink>. &debian; has supported the IOP32x platform in &debian; 7, but does not support it anymore from version 8 on due to hardware constraints of the platform which make it unsuitable for the installation of newer &debian; releases.
fr: On trouve la famille de processeurs d'Intel I/O Processor (IOP) sur nombre de produits relatifs au stockage de données, comme les périphériques <ulink url="&url-arm-cyrius-glantank;">GLAN Tank</ulink> de IO-Data et <ulink url="&url-arm-cyrius-n2100;">Thecus N2100</ulink>. &debian; a pris en charge la plate-forme IOP32x dans &debian; 7, mais ne la prend plus en charge à partir de la version 8 à cause des contraintes matérielles de la plate-forme qui la rende inappropriée pour l'installation des nouvelles versions de &debian;.

source: The MV78xx0 platform has been used on the Marvell DB-78xx0-BP development board. It was supported in Debian 7 with a platform-specific kernel (based on the Linux kernel version 3.2), but is not supported anymore from Debian 8 onwards.
fr: La plate-forme MV78xx0 a été utilisée sur les cartes de développement DB-78xx0-BP de Marvell. Elle a été prise en charge dans Debian 7 avec un noyau spécifique à la plate-forme (basé sur le noyau Linux 3.2), mais n'est plus prise en charge à partir de Debian 8.

source: Platforms supported by Debian/armhf
fr: Plates-formes prises en charge par Debian/armhf

source: The following systems are known to work with &debian;/armhf using the multiplatform (armmp) kernel:
fr: Les systèmes suivants sont connus pour fonctionner avec &debian;/armhf en utilisant le noyau multiplate-forme (armmp) :

source: The IMX53QSB is a development board based on the i.MX53 SOC.
fr: La IMX53QSB est une carte de développement basée sur la puce i.MX53.

source: The Versatile Express is a development board series from ARM consisting of a baseboard which can be equipped with various CPU daughterboards.
fr: La Versatile Express est une série de cartes de développement d'ARM constituée d'une carte de base qui peut être équipée avec diverses cartes filles avec CPU.

source: Certain Allwinner sunXi-based development boards and embedded systems
fr: Certaines cartes de développement et systèmes embarqués basés sur Allwinner sunXi

source: The armmp kernel supports several development boards and embedded systems based on the Allwinner A10 (architecture codename <quote>sun4i</quote>) and A20 (architecture codename <quote>sun7i</quote>) SOCs. Full installer support is currently available for the following sunXi-based systems:
fr: Le noyau armmp prend en charge différentes cartes de développement et systèmes embarqués basés sur les puces Allwiner A10 (nom de code d'architecture <quote>sun4i</quote>) et A20 (nom de code d'architecture <quote>sun7i</quote>). Les systèmes basés sur sunXi suivants sont totalement pris en charge par l'installateur :

source: Olimex A10-Olinuxino-LIME / A10s-Olinuxino Micro / A13-Olinuxino / A13-Olinuxino Micro / A20-Olinuxino Micro
fr: Olimex A10-Olinuxino-LIME, A10s-Olinuxino Micro, A13-Olinuxino, A13-Olinuxino Micro et A20-Olinuxino Micro

source: System support for Allwinner sunXi-based devices is limited to drivers and device-tree information available in the mainline Linux kernel. The android-derived linux-sunxi.org 3.4 kernel series is not supported by Debian.
fr: La prise en charge des périphériques d'Allwinner basés sur sunXi est limitée aux informations des pilotes et arbre de périphériques disponibles dans la branche principale du noyau. La branche linux-sunxi.org 3.4 dérivée d'Android n'est pas prise en charge par Debian.

source: The mainline Linux kernel generally supports serial console, ethernet, SATA, USB and MMC/SD-cards on Allwinner A10 and A20 SOCs, but it does not have local display (HDMI/VGA/LVDS) and audio support. The NAND flash memory that is built into some sunXi-based systems is not supported.
fr: La branche principale du noyau Linux prend généralement en charge la console série, Ethernet, SATA, USB et les cartes MMC/SD sur les puces Allwinner A10 et A20, mais il n’y pas d'affichage local (HDMI/VGA/LVDS) ni de prise en charge de l'audio. La mémoire flash NAND intégrée sur certains systèmes basés sur sunXi n'est pas non plus prise en charge.

source: The Cubox-i series is a set of small, cubical-shaped systems based on the Freescale i.MX6 SOC family. System support for the Cubox-i series is limited to drivers and device-tree information available in the mainline Linux kernel; the Freescale 3.0 kernel series for the Cubox-i is not supported by Debian. Available drivers in the mainline kernel include serial console, ethernet, USB, MMC/SD-card and basic local display support over HDMI.
fr: La série Cubox-i est un ensemble de systèmes petits et cubiques basés sur la famille de puce Freescale i.MX6. La prise en charge de la série Cubox-i est limitée aux informations de pilotes et arbre de périphériques disponibles dans la branche principale du noyau ; la branche du noyau Freescale 3.0 pour les Cubox-i n'est pas prise en charge par Debian. Les pilotes pris en charge dans la branche principale du noyau comprennent la console série, Ethernet, USB, les cartes MMC/SD et la prise en charge basique de l'affichage par HDMI.

source: Generally, the ARM multiplatform support in the Linux kernel allows running &d-i; on armhf systems not explicitly listed above, as long as the kernel used by &d-i; has support for the target system's components and a device-tree file for the target is available. In these cases, the installer can usually provide a working userland installation, but it probably cannot automatically make the system bootable, as doing that in many cases requires device-specific information.
fr: Généralement, la prise en charge d'ARM multiplate-forme dans le noyau Linux permet d'exécuter l'installateur sur les systèmes armhf qui ne sont pas listés ci-dessus tant que le noyau utilisé par l'installateur prend en charge les composants de la cible et qu'un arbre de périphérique est disponible. Dans ce cas, l'installateur peut fournir une installation de l'espace utilisateur fonctionnelle mais ne pourra probablement pas rendre le système automatiquement amorçable, car il faudrait parfois pour cela avoir des informations spécifiques aux périphériques.

source: When using &d-i; on such systems, you have to manually make the system bootable at the end of the installation, e.g. by running the required commands in a shell started from within &d-i;.
fr: Si vous utilisez l'installateur sur de tels systèmes, vous devrez le rendre amorçable vous-même à la fin de l'installation, par exemple en exécutant les commandes nécessaires dans un terminal démarré à l'intérieur de l'installateur.

source: Platforms no longer supported by Debian/armhf
fr: Plates-formes qui ne sont plus prises en charge par Debian/armhf

source: The EfikaMX platform (Genesi Efika Smartbook and Genesi EfikaMX nettop) has been supported in &debian; 7 with a platform-specific kernel, but is not supported anymore from &debian; 8 onwards. The code required to build the formerly used platform-specific kernel has been removed from the upstream Linux kernel source in 2012, so Debian cannot provide newer builds.
fr: La plate-forme EfikaMX (Smartbook Genesi Efika et nettop Genesi EfikaMX) a été prise en charge dans &debian; 7 avec un noyau spécifique, mais n'est plus prise en charge dans &debian; 8. Le code nécessaire pour construire ce noyau spécifique a été retiré de la source amont du noyau Linux en 2012. Debian ne peut donc plus fournir de nouvelles constructions.

source: Using the armmp multiplatform kernel on the EfikaMX platform would require device-tree support for it, which is currently not available.
fr: L'utilisation du noyau multiplate-forme armmp sur la plate-forme EfikaMX nécessiterait une prise en charge d'un arbre de périphériques qui n'est actuellement pas disponible.

source: There are two major support <emphasis>&architecture;</emphasis> flavors: PA-RISC 1.1 and PA-RISC 2.0. The PA-RISC 1.1 architecture is targeted at 32-bit processors whereas the 2.0 architecture is targeted to the 64-bit processors. Some systems are able to run either kernel. In both cases, the userland is 32-bit. There is the possibility of a 64-bit userland in the future.
fr: Il y a 2 versions principales de <emphasis>&architecture;</emphasis>&nbsp;: PA-RISC&nbsp;1.1 et PA-RISC&nbsp;2.0. L'architecture PA-RISC&nbsp;1.1 s'adresse aux processeurs 32 bits tandis que la 2.0 s'adresse aux processeurs 64 bits. Certains systèmes permettent d'exécuter l'un ou l'autre noyau. Dans les deux cas, l'espace utilisateur (<quote>userland</quote>) est en 32 bits. Il y a aura peut-être un espace utilisateur en 64 bits.

source: Complete information concerning supported peripherals can be found at <ulink url="&url-hardware-howto;">Linux Hardware Compatibility HOWTO</ulink>. This section merely outlines the basics.
fr: Vous pouvez trouver une information complète concernant les périphériques reconnus dans le <ulink url="&url-hardware-howto;">HOWTO sur la compatibilité des matériels avec Linux</ulink>. Cette section présente seulement les éléments de base.
